<template>
  <div>
    <h1>Главная</h1>
    <div class="intro">
      <router-link to="/fractions">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 121.805 121.805">
          <path fill="#d8d8d8" d="M7.309 71.663h107.188a7.308 7.308 0 0 0 7.308-7.309 7.308 7.308 0 0 0-7.308-7.309H7.309a7.31 7.31 0 0 0 0 14.618zM60.702 38.776c9.963 0 18.067-8.104 18.067-18.068 0-9.963-8.104-18.068-18.067-18.068-9.962 0-18.069 8.105-18.069 18.068-.001 9.963 8.105 18.068 18.069 18.068zM78.768 101.098c0-9.963-8.104-18.067-18.068-18.067-9.961 0-18.068 8.104-18.068 18.067 0 9.961 8.104 18.067 18.068 18.067 9.963 0 18.068-8.102 18.068-18.067z"/>
        </svg>
        Дроби
      </router-link>
      <router-link to="/websocket">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 492.616 492.616">
          <path fill="#d8d8d8" d="M468.2 135.742c-22.7-50.8-63.9-90.9-116-113.1-82.7-35.2-170.7-28.4-241.6 18.5C41.3 86.942 0 163.742 0 246.642c0 62.4 23.3 121.9 65.7 167.5 42.2 45.4 99.3 73.1 160.9 78 .9.1 1.8.1 2.7.1 8.7 0 17.2-3.3 23.6-9.3 7.2-6.7 11.4-16.1 11.4-26v-75.9c0-1.1-.1-2.2-.3-3.2.2-1 .3-2.1.3-3.2 0-9.9-8.1-18-18-18-45.7 0-82.8-37.1-82.8-82.8v-54.6h165.6v54.6c0 23-9.7 45.1-26.5 60.7-7.3 6.8-7.7 18.1-1 25.4 6.8 7.3 18.1 7.7 25.4 1 24.2-22.4 38-54.2 38-87.1v-72.6c0-9.9-8.1-18-18-18h-39.2v-59c0-9.9-8.1-18-18-18s-18 8.1-18 18v59h-51.2v-59c0-9.9-8.1-18-18-18s-18 8.1-18 18v59h-39.2c-9.9 0-18 8.1-18 18v72.6c.1 59.5 43.9 108.8 100.9 117.5v64.9c-107.9-9.1-192.3-101-192.3-209.5 0-70.8 35.3-136.4 94.5-175.5 60.6-40.1 136.3-45.7 207.6-15.4 43.7 18.5 78.2 52.2 97.2 94.7 40.6 90.9 21.4 190.3-49 253.1-7.4 6.6-8.1 18-1.4 25.4 6.6 7.4 18 8.1 25.4 1.4 38.7-34.6 65.1-79.4 76.4-129.8 12-53.8 5.7-110.8-18.5-164.9z"/>
        </svg>
        Websocket
      </router-link>
    </div>
  </div>
</template>

<script>
export default {
  name: 'home'
}
</script>

<style scoped>
  .intro {
    display: flex;
    flex-direction: row;
    flex-wrap: nowrap;
    justify-content: space-around;
    padding: 1rem;
  }

  .intro a {
    display: block;
    width: 40%;
    height: auto;
    box-sizing: border-box;
    padding: 1rem;
    text-align: center;
    font-size: 3rem;
    font-weight: 700;
    color: #d8d8d8;
    text-decoration: none;

    box-shadow: 0 0 0 0 rgba(0, 0, 0, .1);
    transition: all 200ms ease-out;
  }

  .intro a:hover {
    transform: scale(1.1);
    box-shadow: 0 0.5rem 1rem 0.1rem rgba(0, 0, 0, .1);
  }

  .intro svg {
    display: block;
    margin: 0 0 1rem 0;
    width: 100%;
    height: auto;
  }
</style>
